Repository: laurentbarraud/wpf-chat-server
Catalog: chat-server/Resources/Strings.*.resx
Languages: fr

# ClientConnected
source: Client connected successfully.
fr: Client connecté avec le nom d'utilisateur : {0}

# MessageReceived
source: Message received from {0} :
fr: Message reçu de {0} :

# ServerStartFailed
source: Failed to start server on port {0} : {1}
fr: Échec du démarrage du serveur sur le port {0} : {1}

# BannerLine1
source: Press Ctrl+C to stop the server.
fr: Appuyez sur Ctrl+C pour arrêter le serveur.

# BannerLine2
source: Change the TCP port used for listening or wait 7 seconds.
fr: Changez le port TCP utilisé pour l’écoute ou attendez 7 secondes.

# PortPrompt
source: Enter a port number between 1000 and 65535 [default: 7123]:
fr: Entrez un numéro de port entre 1000 et 65535 [défaut : 7123] :

# InvalidPortPrompt
source: Invalid port, would you like to use default port (7123)? (y/n):
fr: Port invalide, voulez-vous utiliser le port par défaut (7123) ? (o/n) :

# ShutdownStart
source: Shutting down server...
fr: Arrêt du serveur...

# ShutdownComplete
source: Server shutdown complete.
fr: Arrêt du serveur terminé.

# ServerStartedOnPort
source: Listener started on port {0} — waiting for incoming connections...
fr: Écouteur démarré sur le port {0} — en attente de connexions entrantes...

# PublicKeyBroadcastFail
source: Failed to broadcast public key for '{0}': {1}
fr: Échec de la diffusion de la clé publique pour '{0}' : {1}

# PublicKeyBroadcast
source: Broadcasted public key for '{0}'
fr: Clé publique diffusée pour '{0}'

# UnknownOpcode
source: Received packet with unknown opcode.
fr: Opcode inconnu '{1}' reçu de '{0}'

# StreamClosed
source: Remote peer closed the stream.
fr: Flux fermé par le pair distant '{0}'

# IOError
source: I/O error during packet loop.
fr: Erreur E/S pour le client '{0}' : {1}

# ClientRemoved
source: Client '{0}' removed
fr: Client '{0}' supprimé

# RosterSendFailed
source: Failed to send roster to '{0}': {1}
fr: Échec de l’envoi de la liste de contacts à '{0}' : {1}

# DisconnectNotifyFailed
source: Failed to notify disconnection of '{0}': {1}
fr: Échec de la notification de déconnexion de '{0}' : {1}

# UserDisconnected
source: User '{0}' disconnected
fr: Utilisateur '{0}' déconnecté

# PlainMessageBroadcast
source: Broadcasted message from '{0}'
fr: Message diffusé de '{0}'

# PlainMessageSendFailed
source: Failed to send message to '{0}': {1}
fr: Échec de l’envoi du message à '{0}' : {1}

# UnexpectedOpcode
source: Unexpected opcode '{1}' from '{0}'
fr: Opcode inattendu '{1}' reçu de '{0}'

# EncryptedDeliverFailed
source: Failed to deliver encrypted message to '{0}': {1}
fr: Échec de la livraison du message chiffré à '{0}' : {1}

# EncryptedMessageRelay
source: Relayed encrypted message from '{0}'
fr: Message chiffré relayé de '{0}'

# EncryptedSendError
source: Error sending encrypted message to '{0}': {1}
fr: Erreur d’envoi du message chiffré à '{0}' : {1}

# PublicKeyRequestTargetNotFound
source: Public key request failed: target '{0}' not found
fr: Requête de clé publique échouée : cible '{0}' introuvable

# PublicKeyRequestRequesterNotConnected
source: Public key request failed: requester '{0}' not connected
fr: Requête de clé publique échouée : demandeur '{0}' non connecté

# PublicKeyRequestSuccess
source: Public key of '{0}' sent successfully
fr: Clé publique de '{0}' envoyée avec succès

# PublicKeyRequestSendError
source: Failed to send public key to '{0}': {1}
fr: Échec de l’envoi de la clé publique à '{0}' : {1}

# PublicKeyDeliverFail
source: Delivery of public key to '{0}' failed: {1}
fr: Livraison de la clé publique à '{0}' échouée : {1}

# PublicKeyDelivered
source: Public key delivered to '{0}'
fr: Clé publique livrée à '{0}'

# PublicKeyDeliverError
source: Error delivering public key to '{0}': {1}
fr: Erreur lors de la livraison de la clé publique à '{0}' : {1}

# ShutdownNotifyFail
source: Failed to notify shutdown to '{0}': {1}
fr: Échec de la notification d’arrêt à '{0}' : {1}

# AcceptLoopError
source: Error in accept loop: {0}
fr: Erreur dans la boucle d’acceptation : {0}

# IncomingConnection
source: Incoming connection from '{0}'
fr: Connexion entrante depuis '{0}'

source: Exiting...
fr: Fermeture...

# RosterSendSuccess
source: Successfully sent roster to '{0}'
fr: Envoi de la liste des utilisateurs vers « {0} » réussi

# MessageRelaySuccess
source: Message relayed successfully to {0}.
fr: Message relayé avec succès à {0}.

# MessageRelayFailed
source: Failed to relay message to {0}: {1}
fr: Échec du relais du message à {0} : {1}

# ErrorPublicKeyLengthInvalid
source: Public key length in handshake is invalid.
fr: Longueur de clé publique invalide reçue du client {0}.

# ErrorInvalidOperationException
source: Unexpected opcode during handshake processing.
fr: Opcode inattendu reçu lors du handshake : {0}

# ErrorInvalidDataException
source: Invalid data encountered while processing handshake.
fr: Données de handshake invalides : {0}

# ErrorInvalidHandshakeLength
source: Invalid handshake payload length received during connection initialization.
fr: Longueur du payload de handshake invalide : {0}

# InvalidFrameLength
source: Received invalid frame length.
fr: Longueur de trame invalide reçue du client {0} : {1}

# StreamDisposed
source: Stream disposed while reading.
fr: Flux réseau disposé pour le client {0}

# ErrorClientCleanup
source: Error occurred during client cleanup.
fr: Erreur lors du nettoyage pour le client {0} : {1}

# ClientCleanupComplete
source: Client cleanup completed.
fr: Nettoyage du client terminé pour {0}
