Repository: laurentbarraud/wpf-chat-server
Catalog: ChatClient/Resources/Strings.*.resx
Languages: es, fr

# AppLanguageLabel
source: Application language
es: Idioma de la aplicación
fr: Langue de l'application

# ChooseAnAppropriatePortNumber
source: Please choose a number between 1000 and 65535.
es: Elija un número entre 1000 y 65535.
fr: Veuillez choisir un nombre entre 1000 et 65535.

# ClientSocketNotConnected
source: Client socket is not connected.
es: El socket del cliente no está conectado.
fr: Le socket du client n’est pas connecté.

source: _Connect
es: _Conectar
fr: _Connecter

source: Connected
es: Conectado
fr: Connecté

source: Connection failed.
es: La conexión ha fallado.
fr: La connexion a échoué.

# ErrorDecryptionFailed
source: [Decryption failed]
es: [Error al descifrar]
fr: [Le déchiffrage a échoué]

source: _Disconnect
es: _Desconectar
fr: _Déconnecter

source: Disconnect error
es: Error al desconectar
fr: Erreur de déconnexion

# EncryptionEnabledToolTip
source: Message encryption is enabled.
es: Cifrado de mensajes activado.
fr: Chiffrage des messages activé.

# ErrorInActivatingEncryption
source: Encryption could not be activated.
es: No se pudo activar el cifrado.
fr: Le chiffrement n'a pas pu être activé.

# ErrorLoadingThemeResources
source: An error occurred while loading settings. Please check your theme resources.
es: Ocurrió un error al cargar la configuración. Verifique los recursos del tema.
fr: Une erreur s’est produite lors du chargement des paramètres. Veuillez vérifier les ressources de votre thème.

source: Error while disconnecting :
es: Error al desconectar:
fr: Erreur pendant la déconnexion :

source: has connected
es: se ha conectado
fr: s'est connecté

source: has disconnected
es: se ha desconectado
fr: s'est déconnecté

# InvalidPublicKey
source: Invalid public key. Encryption was not enabled.
es: Clave pública inválida. El cifrado no se activó.
fr: Clé publique invalide. Le chiffrement n'a pas été activé.

# IPAddressInvalid
source: The IP address is incorrect. Leave it blank to connect locally.
es: La dirección IP es incorrecta. Déjela vacía para conectarse localmente.
fr: L’adresse IP est incorrecte. Laissez-la vide pour vous connecter localement.

# LicenceFinal
source: v1.0 - Jan. 2026 - Laurent Barraud
es: v1.1 - feb. 2026 - Laurent Barraud
fr: v1.0 - janv. 2026 - Laurent Barraud

# LicenceInfo
source: This open-source software is distributed in the hope that it will be useful, but without any warranty.
es: Este software de código abierto se distribuye con la esperanza de que sea útil, pero sin ninguna garantía.
fr: Ce logiciel open‑source est fourni dans l'espoir qu'il sera utile, mais sans garantie.

# LicenceInfoResources
source: Button images and icons inspired by resources available on Flaticon.com.
es: Imágenes de botones e iconos inspirados en recursos disponibles en Flaticon.com.
fr: Images de boutons et icônes inspirées par des ressources disponibles sur Flaticon.com.

# PortNumberInvalid
source: Port number is not valid.
es: El número de puerto no es válido.
fr: Numéro de port erroné.

# PortNumberValid
source: Port number is valid.
es: El número de puerto es válido.
fr: Numéro de port valide.

# PublicKeyRejected
source: The public key was rejected by the server. Encryption was not enabled.
es: La clave pública fue rechazada por el servidor. El cifrado no se activó.
fr: La clé publique a été rejetée par le serveur. Le chiffrement n'a pas été activé.

# ReduceToTrayLabel
source: Reduce in system tray
es: Minimizar en la bandeja del sistema
fr: Réduire dans la zone de notification

# SendingClientsPublicRSAKeyToTheServerFailed
source: Failed to send the public RSA key to the server. Please check your connection.
es: No se pudo enviar la clave pública RSA al servidor. Verifique su conexión.
fr: Échec de l’envoi de la clé RSA publique au serveur. Veuillez vérifier votre connexion.

# DisconnectedByServer
source: You have been disconnected by the server
es: Ha sido desconectado por el servidor
fr: Vous avez été déconnecté par le serveur

# ServerUnreachable
source: The server is unreachable or has refused the connection.
es: El servidor no está disponible o ha rechazado la conexión.
fr: Le serveur est inaccessible ou a refusé la connexion.

# TrayOpenLabel
source: Open
es: Abrir
fr: Ouvrir

# TrayQuitLabel
source: Quit
es: Salir
fr: Quitter

# UseTcpPortLabel
source: Use TCP port :
es: Usar puerto TCP:
fr: Utiliser le port TCP :

# UseEncryptionLabel
source: Use encryption for messages
es: Usar cifrado para los mensajes
fr: Chiffrement des messages

# GettingMissingKeysToolTip
source: Getting missing keys...
es: Obteniendo claves faltantes...
fr: Obtention des clés manquantes...

source: Sending public key...
es: Enviando clave pública...
fr: Envoi de la clé publique...

# ScrollLeftToolTip
source: Scroll left
es: Desplazar a la izquierda
fr: Faire défiler à gauche

# ScrollRightToolTip
source: Scroll right
es: Desplazar a la derecha
fr: Faire défiler à droite

# CliOptionsHelpTitle
source: Command Line Help
es: Ayuda de línea de comandos
fr: Aide en ligne de commande

# CliOptionsHelpText
source: Usage: chat-client.exe [options] Options: -u, --username Set your username and auto-connect -p, --port Set the server port --dark, --light Switch to theme --en, --english Switch to English --fr, --french Switch to French -e, --encrypted Enable end-to-end encryption -r, -t, -m, --reduce Enable minimize to system tray --tray, --min -c, -d, --debug Open console window -h, -? , --help Display this help message -v, --about, Open the About window --version All arguments support Windows-style (/option) and Unix-style (--option) notation. Example: chat-client.exe --dark /t /e /u Laurent
es: Uso: chat-client.exe [opciones] Opciones: -u, --nombre, --username Establecer nombre de usuario y auto-conectar -p, --port, --puerto Establecer el puerto del servidor --oscuro, --dark Cambiar al tema oscuro --claro, --light Cambiar al tema claro --es, --español Cambiar al español --en, --english Cambiar a inglés --fr, --francés Cambiar a francés -e, --enc, --encrypted Activar cifrado de extremo a extremo -r, -t, -m, --reduce Activar minimizar a la bandeja del sistema --tray, --bandeja Alias para la bandeja del sistema -c, -d, --debug Abrir ventana de consola -h, -? , --help, --ayuda Mostrar este mensaje de ayuda -v, --about, --version Abrir la ventana Acerca de / mostrar versión Todos los argumentos admiten notación estilo Windows (/opción) y estilo Unix (--opción). Ejemplo: chat-client.exe --oscuro /t /e /u Laurent
fr: Utilisation : chat-client.exe [options] Options : -u, --username Définir votre nom d'utilisateur et se connecter automatiquement -p, --port Définir le port du serveur --dark, --light Basculer sur le thème --en, --english Basculer en anglais --fr, --french Basculer en français -e, --encrypted Activer le chiffrement de bout en bout -r, -t, -m --reduce Activer la réduction dans la zone de notification --tray, --min -c, -d, --debug Ouvrir la fenêtre console -h, -? , --help Afficher ce message d'aide -v, --about, Ouvrir la fenêtre A propos --version Toutes les options acceptent la notation Windows (/option) et Unix (--option). Exemple : chat-client.exe --dark /t /e /u Laurent

# CliArgumentsText
source: Command-line arguments
es: Argumentos de línea de comandos
fr: Arguments de ligne de commande

# MessageSendingFailed
source: [Error : Your message failed to send.]
es: [Error: Su mensaje no se pudo enviar.]
fr: [Erreur : l’envoi du message a échoué.]

# SendingFailed
source: Failed to send message.
es: No se pudo enviar el mensaje.
fr: Échec de l’envoi du message.

# SettingsToolTip
source: Settings
es: Configuración
fr: Paramètres

# ErrorPlaintextEmpty
source: Plaintext must not be empty.
es: El texto sin cifrar no debe estar vacío.
fr: Le texte en clair ne doit pas être vide.

# ErrorPublicKeyMissing
source: Recipient public key DER must not be null or empty.
es: La clave pública DER del destinatario no debe ser nula ni vacía.
fr: La clé publique du destinataire (DER) ne doit pas être nulle ou vide.

# ErrorEncryptionFailed
source: Encryption failed: {0}
es: Error de cifrado: {0}
fr: Échec du chiffrement : {0}

# ErrorInitializeClient
source: Failed to initialize client: {0}
es: Error al inicializar el cliente: {0}
fr: Échec de l'initialisation du client : {0}

# ErrorFailedToSendInitialHandshake
source: Failed to send initial handshake to server
es: Error al enviar el saludo inicial al servidor
fr: Échec de l'envoi du handshake initial vers le serveur

# ActivateEncryptionToRead
source: Please activate encryption in settings to keep reading incoming messages #
es: Active el cifrado en la configuración para seguir leyendo los mensajes entrantes
fr: Veuillez activer le chiffrement dans les paramètres pour continuer à lire les messages entrants #

# ServerPrefix
source: # - Server:
es: # - Servidor:
fr: # - Serveur:

# DisplayFontSizeLabel
source: Text size for conversations and connected users list
es: Tamaño del texto para conversaciones y lista de usuarios conectados
fr: Taille du texte des conversations et de la liste des utilisateurs

# MessageInputFieldLeftOffsetLabel
source: Input field left offset
es: Desplazamiento izquierdo del campo de entrada
fr: Décalage du champ de saisie depuis la gauche

# MessageInputFieldWidthLabel
source: Input field width
es: Ancho del campo de entrada
fr: Largeur du champ de saisie

# MessageInputFieldWatermark
source: Enter a message...
es: Escriba un mensaje...
fr: Entrez un message...

# UsernameWatermark
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur

# IPAddressWatermark
source: Server IP address
es: Dirección IP del servidor
fr: Adresse IP du serveur

# EnableEncryptionToKeepReadingMessages
source: Please enable encryption to keep reading incoming messages.
es: Active el cifrado para seguir leyendo los mensajes entrantes.
fr: Veuillez activer le chiffrement pour continuer à lire les messages reçus.

# AboutThisSoftwareLabel
source: About this software
es: Acerca de este software
fr: A propos de ce logiciel

# MonitorWindowTitle
source: Public Keys Monitor
es: Monitor de claves públicas
fr: Moniteur de clés publiques

# ValidPublicKey
source: Valid key
es: Clave válida

# EnableEncryptionToSeePublicKeysState
source: Please enable message encryption to see public keys state.
es: Active el cifrado de mensajes para ver el estado de las claves públicas.

# NotConnected
source: Please login to see public keys state.
es: Inicie sesión para ver el estado de las claves públicas.

# MissingOrInvalidPublicKey
source: Missing or invalid key
es: Clave perdida o inválida

# UsernameHeader
source: User
es: Usuario

# KeyExcerptHeader
source: Key excerpt
es: Extracto de clave

# StatusHeader
source: Status
es: Estado

# ActionHeader
source: Action
es: Acción

source: Error
fr: Erreur
